//==================================================================
//文件名称:	流水灯应用函数文件
//功能说明: 实现流水灯
//硬件描述: P1口
//资源说明: 11.0592M晶体
//创建日期: 2015/11/13
//软件版本: v 1.1     
//==================================================================

//==========================包含头文件==============================
#include "app.h"
#include "delay.h"

//=============================宏定义===============================
#define  LED_Port    P1

//==================================================================
//函 数 名:  Mn_App()
//功能描述:  实现流水灯的功能
//输入参数: 
//输出参数:	
//设 计 者：
//创建日期：
//==================================================================
void Mn_App(void)
{	    
	uchar i;
	uchar LED_flow=0xfe;
    //左移
	for(i=0;i<8;i++)
	{	
    	LED_Port=LED_flow;
		Delay_Ms(200);
		LED_flow<<=1;
		LED_flow++;				
	}
    //右移
	LED_flow-=0x80;
	for(i=0;i<6;i++)
	{		
		LED_flow>>=1;
 		LED_flow+=0x80;
		LED_Port=LED_flow;
		Delay_Ms(200);	
	}		
}


