//==================================================================
//文件名称: 延时函数头文件
//功能说明:	点亮LED
//硬件描述: p1口
//使用晶体:	12M晶体
//创建日期:	2015.9.26
//软件版本:	v1.0    
//==================================================================
#ifndef _DELAY_H_
#define _DELAY_H_

//==========================包含头文件==============================
#include <reg51.h>

//=============================宏定义===============================
#define uchar unsigned char
#define uint  unsigned int

//=============================函数声明=============================
void Delay_Ms(uint n);                                                 //声明对外提供的接口函数

#endif
