//==================================================================
//文件名称:	LED显示函数
//功能说明: 发光二级管的闪烁
//硬件描述: P1口
//资源说明: 11.0592M晶体
//创建日期: 2015/11/13
//软件版本: v 1.1     
//==================================================================

//==========================包含头文件==============================
#include <reg51.h>

//=============================宏定义===============================
#define	uchar  unsigned char
#define	uint   unsigned int

#define ledPort	P1                                                    

#define	led_On()   ledPort=0x00                                       //灯全亮
#define	led_Off()  ledPort=0xff                                       //灯全灭

//==================================================================
//函 数 名: Delay_Ms()
//功能描述: 1ms延时函数（113是根据汇编指令周期计算得来的）
//输入参数: uint n
//输出参数:	
//设 计 者：
//创建日期：
//==================================================================
void Delay_Ms(uint n)
{
	uint data i,j;
	for(i=0;i<n;i++)
	for(j=0;j<113;j++);
}
//==================================================================
//函 数 名:  main()
//功能描述: 包括主循环，实现八个灯的闪烁
//输入参数: 
//输出参数:	
//设 计 者：
//创建日期：
//==================================================================
void	main()
{
	ledPort=0x00;                                                    //初始化
	while(1)
	{
		led_On();
		Delay_Ms(200);
		led_Off();
		Delay_Ms(200);
	}
}




